; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-2-36)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p2-1 - location
	p2-3 - location
	p2-5 - location
	p2-6 - location
	p4-0 - location
	p5-1 - location
	p5-6 - location
	p6-2 - location
	p6-3 - location
	p6-4 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s6)
	(at driver3 s0)
	(at driver4 s2)
	(at driver5 s3)
	(at driver6 s5)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at package1 s4)
	(at package2 s3)
	(at package3 s3)
	(at package4 s6)
	(at package5 s6)
	(at package6 s4)
	(at package7 s1)
	(at package8 s2)
	(at package9 s4)
	(at package10 s5)
	(at package11 s4)
	(at package12 s4)
	(at package13 s4)
	(at package14 s4)
	(at package15 s1)
	(at package16 s6)
	(at package17 s4)
	(at package18 s2)
	(at package19 s2)
	(at package20 s2)
	(at package21 s2)
	(at package22 s4)
	(at package23 s6)
	(at package24 s4)
	(at package25 s4)
	(at package26 s1)
	(at package27 s2)
	(at package28 s6)
	(at package29 s3)
	(at package30 s5)
	(at package31 s0)
	(at package32 s2)
	(at package33 s6)
	(at package34 s1)
	(at package35 s2)
	(at package36 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(path s5 p5-6)
	(path p5-6 s5)
	(path s6 p5-6)
	(path p5-6 s6)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(link s0 s2)
	(link s2 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s6)
	(link s6 s0)
	(link s2 s1)
	(link s1 s2)
	(link s2 s3)
	(link s3 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s4)
	(link s4 s3)
	(link s3 s6)
	(link s6 s3)
	(link s4 s2)
	(link s2 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s2)
	(link s2 s5)
	(link s5 s3)
	(link s3 s5)
	(link s6 s2)
	(link s2 s6)
	(link s6 s5)
	(link s5 s6)
)
	(:goal (and
	(at driver1 s6)
	(at driver3 s6)
	(at driver4 s0)
	(at truck2 s6)
	(at package3 s2)
	(at package4 s2)
	(at package5 s2)
	(at package6 s5)
	(at package7 s1)
	(at package10 s1)
	(at package11 s5)
	(at package12 s2)
	(at package13 s5)
	(at package15 s4)
	(at package16 s1)
	(at package17 s3)
	(at package18 s5)
	(at package19 s2)
	(at package20 s1)
	(at package21 s5)
	(at package22 s3)
	(at package23 s0)
	(at package24 s4)
	(at package25 s6)
	(at package27 s3)
	(at package28 s5)
	(at package29 s1)
	(at package31 s6)
	(at package32 s4)
	(at package33 s3)
	(at package35 s6)
	(at package36 s0)
	))


)

; plan
1. (board-truck driver1 s3 truck1)
   deleted: (at driver1 s3) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 32
2. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 4 of 32
3. (load-truck s2 package35 truck1)
   deleted: (at package35 s2)
   added: (in package35 truck1)
   goals met: 4 of 32
4. (load-truck s2 package32 truck1)
   deleted: (at package32 s2)
   added: (in package32 truck1)
   goals met: 4 of 32
5. (load-truck s2 package27 truck1)
   deleted: (at package27 s2)
   added: (in package27 truck1)
   goals met: 4 of 32
6. (load-truck s2 package21 truck1)
   deleted: (at package21 s2)
   added: (in package21 truck1)
   goals met: 4 of 32
7. (load-truck s2 package20 truck1)
   deleted: (at package20 s2)
   added: (in package20 truck1)
   goals met: 4 of 32
8. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 4 of 32
9. (load-truck s3 package3 truck1)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   goals met: 4 of 32
10. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 4 of 32
11. (unload-truck s2 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   goals met: 5 of 32
12. (load-truck s2 package18 truck1)
   deleted: (at package18 s2)
   added: (in package18 truck1)
   goals met: 5 of 32
13. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 5 of 32
14. (load-truck s3 package29 truck1)
   deleted: (at package29 s3)
   added: (in package29 truck1)
   goals met: 5 of 32
15. (unload-truck s3 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s3)
   goals met: 6 of 32
16. (walk driver3 s0 p4-0)
   deleted: (at driver3 s0)
   added: (at driver3 p4-0)
   goals met: 6 of 32
17. (walk driver3 p4-0 s4)
   deleted: (at driver3 p4-0)
   added: (at driver3 s4)
   goals met: 6 of 32
18. (drive-truck driver1 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 6 of 32
19. (drive-truck driver1 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 6 of 32
20. (load-truck s6 package5 truck1)
   deleted: (at package5 s6)
   added: (in package5 truck1)
   goals met: 6 of 32
21. (load-truck s6 package4 truck1)
   deleted: (at package4 s6)
   added: (in package4 truck1)
   goals met: 6 of 32
22. (unload-truck s6 package35 truck1)
   deleted: (in package35 truck1)
   added: (at package35 s6)
   goals met: 7 of 32
23. (drive-truck driver1 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 7 of 32
24. (unload-truck s2 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   goals met: 8 of 32
25. (drive-truck driver1 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 8 of 32
26. (unload-truck s5 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s5)
   goals met: 9 of 32
27. (unload-truck s5 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s5)
   goals met: 10 of 32
28. (drive-truck driver1 s5 s2 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s2)
   goals met: 10 of 32
29. (unload-truck s2 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 11 of 32
30. (drive-truck driver1 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 11 of 32
31. (load-truck s6 package33 truck1)
   deleted: (at package33 s6)
   added: (in package33 truck1)
   goals met: 11 of 32
32. (load-truck s6 package28 truck1)
   deleted: (at package28 s6)
   added: (in package28 truck1)
   goals met: 11 of 32
33. (drive-truck driver1 s6 s3 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   goals met: 11 of 32
34. (drive-truck driver1 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 11 of 32
35. (unload-truck s5 package28 truck1)
   deleted: (in package28 truck1)
   added: (at package28 s5)
   goals met: 12 of 32
36. (load-truck s5 package10 truck1)
   deleted: (at package10 s5)
   added: (in package10 truck1)
   goals met: 12 of 32
37. (drive-truck driver1 s5 s3 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   goals met: 12 of 32
38. (unload-truck s3 package33 truck1)
   deleted: (in package33 truck1)
   added: (at package33 s3)
   goals met: 13 of 32
39. (drive-truck driver1 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 13 of 32
40. (load-truck s4 package6 truck1)
   deleted: (at package6 s4)
   added: (in package6 truck1)
   goals met: 13 of 32
41. (drive-truck driver1 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 13 of 32
42. (board-truck driver3 s4 truck2)
   deleted: (at driver3 s4) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 13 of 32
43. (load-truck s4 package25 truck2)
   deleted: (at package25 s4)
   added: (in package25 truck2)
   goals met: 13 of 32
44. (load-truck s4 package22 truck2)
   deleted: (at package22 s4)
   added: (in package22 truck2)
   goals met: 13 of 32
45. (load-truck s4 package17 truck2)
   deleted: (at package17 s4)
   added: (in package17 truck2)
   goals met: 13 of 32
46. (drive-truck driver3 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 13 of 32
47. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 13 of 32
48. (unload-truck s1 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s1)
   goals met: 14 of 32
49. (unload-truck s1 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s1)
   goals met: 15 of 32
50. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 15 of 32
51. (drive-truck driver1 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 15 of 32
52. (load-truck s6 package23 truck1)
   deleted: (at package23 s6)
   added: (in package23 truck1)
   goals met: 15 of 32
53. (load-truck s6 package16 truck1)
   deleted: (at package16 s6)
   added: (in package16 truck1)
   goals met: 15 of 32
54. (drive-truck driver1 s6 s0 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 15 of 32
55. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 15 of 32
56. (drive-truck driver3 s3 s6 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s6)
   goals met: 16 of 32
57. (unload-truck s6 package25 truck2)
   deleted: (in package25 truck2)
   added: (at package25 s6)
   goals met: 17 of 32
58. (drive-truck driver3 s6 s3 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s3)
   goals met: 16 of 32
59. (unload-truck s3 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s3)
   goals met: 17 of 32
60. (unload-truck s3 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s3)
   goals met: 18 of 32
61. (drive-truck driver3 s3 s4 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   goals met: 18 of 32
62. (load-truck s4 package13 truck2)
   deleted: (at package13 s4)
   added: (in package13 truck2)
   goals met: 18 of 32
63. (drive-truck driver3 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 18 of 32
64. (drive-truck driver3 s3 s5 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s5)
   goals met: 18 of 32
65. (unload-truck s5 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s5)
   goals met: 19 of 32
66. (drive-truck driver3 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 19 of 32
67. (load-truck s0 package31 truck2)
   deleted: (at package31 s0)
   added: (in package31 truck2)
   goals met: 19 of 32
68. (drive-truck driver3 s0 s6 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   goals met: 20 of 32
69. (disembark-truck driver3 s6 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s6) (empty truck2)
   goals met: 21 of 32
70. (unload-truck s6 package31 truck2)
   deleted: (in package31 truck2)
   added: (at package31 s6)
   goals met: 22 of 32
71. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 22 of 32
72. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 22 of 32
73. (walk driver4 s2 p2-1)
   deleted: (at driver4 s2)
   added: (at driver4 p2-1)
   goals met: 22 of 32
74. (walk driver4 p2-1 s1)
   deleted: (at driver4 p2-1)
   added: (at driver4 s1)
   goals met: 22 of 32
75. (walk driver4 s1 p0-1)
   deleted: (at driver4 s1)
   added: (at driver4 p0-1)
   goals met: 22 of 32
76. (walk driver4 p0-1 s0)
   deleted: (at driver4 p0-1)
   added: (at driver4 s0)
   goals met: 23 of 32
77. (drive-truck driver1 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 23 of 32
78. (unload-truck s1 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s1)
   goals met: 24 of 32
79. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 24 of 32
80. (drive-truck driver1 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 24 of 32
81. (unload-truck s4 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s4)
   goals met: 25 of 32
82. (drive-truck driver1 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 25 of 32
83. (drive-truck driver1 s2 s5 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s5)
   goals met: 25 of 32
84. (unload-truck s5 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 26 of 32
85. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 26 of 32
86. (load-truck s1 package15 truck1)
   deleted: (at package15 s1)
   added: (in package15 truck1)
   goals met: 26 of 32
87. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 26 of 32
88. (drive-truck driver1 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 26 of 32
89. (unload-truck s4 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s4)
   goals met: 27 of 32
90. (load-truck s4 package12 truck1)
   deleted: (at package12 s4)
   added: (in package12 truck1)
   goals met: 27 of 32
91. (drive-truck driver1 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 27 of 32
92. (unload-truck s2 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s2)
   goals met: 28 of 32
93. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 28 of 32
94. (unload-truck s0 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s0)
   goals met: 29 of 32
95. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 29 of 32
96. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 29 of 32
97. (unload-truck s1 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s1)
   goals met: 30 of 32
98. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 30 of 32
99. (drive-truck driver1 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 30 of 32
100. (load-truck s4 package11 truck1)
   deleted: (at package11 s4)
   added: (in package11 truck1)
   goals met: 30 of 32
101. (drive-truck driver1 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 30 of 32
102. (drive-truck driver1 s3 s5 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s5)
   goals met: 30 of 32
103. (unload-truck s5 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s5)
   goals met: 31 of 32
104. (drive-truck driver1 s5 s6 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s6)
   goals met: 31 of 32
105. (disembark-truck driver1 s6 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s6) (empty truck1)
   goals met: 32 of 32
